/* automatically generated by rust-bindgen 0.57.0 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LONG_DOUBLE_USES_FLOAT128: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;

pub const GL_SGIS_fog_function: u32 = 1;
pub const GL_SGIS_generate_mipmap: u32 = 1;
pub const GL_SGIS_multisample: u32 = 1;
pub const GL_SGIS_pixel_texture: u32 = 1;
pub const GL_SGIS_point_line_texgen: u32 = 1;
pub const GL_SGIS_point_parameters: u32 = 1;
pub const GL_SGIS_sharpen_texture: u32 = 1;
pub const GL_SGIS_texture4D: u32 = 1;
pub const GL_SGIS_texture_border_clamp: u32 = 1;
pub const GL_SGIS_texture_color_mask: u32 = 1;
pub const GL_SGIS_texture_edge_clamp: u32 = 1;
pub const GL_SGIS_texture_filter4: u32 = 1;
pub const GL_SGIS_texture_lod: u32 = 1;
pub const GL_SGIS_texture_select: u32 = 1;
pub const GL_SGIX_async: u32 = 1;
pub const GL_SGIX_async_histogram: u32 = 1;
pub const GL_SGIX_async_pixel: u32 = 1;
pub const GL_SGIX_blend_alpha_minmax: u32 = 1;
pub const GL_SGIX_calligraphic_fragment: u32 = 1;
pub const GL_SGIX_clipmap: u32 = 1;
pub const GL_SGIX_convolution_accuracy: u32 = 1;
pub const GL_SGIX_depth_pass_instrument: u32 = 1;
pub const GL_SGIX_depth_texture: u32 = 1;
pub const GL_SGIX_flush_raster: u32 = 1;
pub const GL_SGIX_fog_offset: u32 = 1;
pub const GL_SGIX_fragment_lighting: u32 = 1;
pub const GL_SGIX_framezoom: u32 = 1;
pub const GL_SGIX_igloo_interface: u32 = 1;
pub const GL_SGIX_instruments: u32 = 1;
pub const GL_SGIX_interlace: u32 = 1;
pub const GL_SGIX_ir_instrument1: u32 = 1;
pub const GL_SGIX_list_priority: u32 = 1;
pub const GL_SGIX_pixel_texture: u32 = 1;
pub const GL_SGIX_pixel_tiles: u32 = 1;
pub const GL_SGIX_polynomial_ffd: u32 = 1;
pub const GL_SGIX_reference_plane: u32 = 1;
pub const GL_SGIX_resample: u32 = 1;
pub const GL_SGIX_scalebias_hint: u32 = 1;
pub const GL_SGIX_shadow: u32 = 1;
pub const GL_SGIX_shadow_ambient: u32 = 1;
pub const GL_SGIX_sprite: u32 = 1;
pub const GL_SGIX_subsample: u32 = 1;
pub const GL_SGIX_tag_sample_buffer: u32 = 1;
pub const GL_SGIX_texture_add_env: u32 = 1;
pub const GL_SGIX_texture_coordinate_clamp: u32 = 1;
pub const GL_SGIX_texture_lod_bias: u32 = 1;
pub const GL_SGIX_texture_multi_buffer: u32 = 1;
pub const GL_SGIX_texture_scale_bias: u32 = 1;
pub const GL_SGIX_vertex_preclip: u32 = 1;
pub const GL_SGIX_ycrcb: u32 = 1;
pub const GL_SGIX_ycrcb_subsample: u32 = 1;
pub const GL_SGIX_ycrcba: u32 = 1;
pub const GL_SGI_color_matrix: u32 = 1;
pub const GL_SGI_color_table: u32 = 1;
pub const GL_SGI_texture_color_table: u32 = 1;
pub const GL_SUNX_constant_data: u32 = 1;
pub const GL_SUN_convolution_border_modes: u32 = 1;
pub const GL_SUN_global_alpha: u32 = 1;
pub const GL_SUN_mesh_array: u32 = 1;
pub const GL_SUN_slice_accum: u32 = 1;
pub const GL_SUN_triangle_list: u32 = 1;
pub const GL_SUN_vertex: u32 = 1;
pub const GL_WIN_phong_shading: u32 = 1;
pub const GL_WIN_specular_fog: u32 = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gladGLversionStruct {
    pub major: ::std::os::raw::c_int,
    pub minor: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gladGLversionStruct() {
    assert_eq!(
        ::std::mem::size_of::<gladGLversionStruct>(),
        8usize,
        concat!("Size of: ", stringify!(gladGLversionStruct))
    );
    assert_eq!(
        ::std::mem::align_of::<gladGLversionStruct>(),
        4usize,
        concat!("Alignment of ", stringify!(gladGLversionStruct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gladGLversionStruct>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gladGLversionStruct),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gladGLversionStruct>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gladGLversionStruct),
            "::",
            stringify!(minor)
        )
    );
}
pub type GLADloadproc = ::std::option::Option<
    unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
>;
extern "C" {
    pub static mut GLVersion: gladGLversionStruct;
}
extern "C" {
    pub fn gladLoadGL() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gladLoadGLLoader(arg1: GLADloadproc) -> ::std::os::raw::c_int;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
